<center>
    <h1 style="color:blue"> YSU MMF, Python, Spring 2021 </h1>
    <h2 style="color:blue"> Lecture 21 </h2>
</center>

In [1]:
import numpy as np
import matplotlib.pyplot as plt

In [2]:
import pandas as pd

## Pandas Series

- Change one of the values in the Series

In [3]:
a = [1, 2, 3, 4]
b = ["a", "b", "c", "d"]
s1 = pd.Series(a,b)
s1

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
s1[["a", "d"]] = [50, 60]
s1

a    50
b     2
c     3
d    60
dtype: int64

- Create a Series of random numbers, choose all positives and their indices

In [5]:
s2 = pd.Series(np.random.randn(10))
s2

0   -0.420813
1    1.581992
2   -0.736702
3    0.288314
4   -0.868940
5    1.112200
6   -0.939203
7   -1.515800
8   -0.536161
9    1.109026
dtype: float64

In [6]:
s2a = s2[s2 > 0]
s2a

1    1.581992
3    0.288314
5    1.112200
9    1.109026
dtype: float64

In [7]:
s2a.index

Int64Index([1, 3, 5, 9], dtype='int64')

In [8]:
s2a.values

array([1.58199159, 0.28831415, 1.11219982, 1.10902599])

- Multiply all elements in the Series by 3

In [10]:
s2 * 3

0   -1.262440
1    4.745975
2   -2.210106
3    0.864942
4   -2.606819
5    3.336599
6   -2.817610
7   -4.547401
8   -1.608483
9    3.327078
dtype: float64

- Calculate the Exponential of all elements in the Series

In [11]:
np.exp(s2)

0    0.656513
1    4.864635
2    0.478690
3    1.334176
4    0.419396
5    3.041041
6    0.390939
7    0.219632
8    0.584990
9    3.031404
dtype: float64

- Add two Series with the same/not all the same indices

In [12]:
s3 = pd.Series(np.arange(5), index=list("abcde"))
s4 = pd.Series([10, 20, 30, 40, 50], index=list("abcde"))
s3

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [13]:
s4

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [14]:
s3 + s4

a    10
b    21
c    32
d    43
e    54
dtype: int64

In [15]:
s5 = pd.Series(100 * np.arange(1, 6), index = ["a", "e", "d", "f","g"])
s5

a    100
e    200
d    300
f    400
g    500
dtype: int32

In [16]:
s1 + s5

a    150.0
b      NaN
c      NaN
d    360.0
e      NaN
f      NaN
g      NaN
dtype: float64

- Give a name for Series and its indices

In [18]:
s5.name = "Grades"

In [19]:
s5.index.name = "No"

In [20]:
s5

No
a    100
e    200
d    300
f    400
g    500
Name: Grades, dtype: int32

## Pandas DataFrame

- Create a DataFrame from a list, then change the column name

In [21]:
l = [1, 2, 3, 4]

In [24]:
df1 = pd.DataFrame(l, index = ["AA", "AB", "AC", "AD"])
df1

    0
AA  1
AB  2
AC  3
AD  4

- Create a DataFrame from the List of Lists

In [67]:
l1 = [[1, 2, 3, 4], [5, 6, 7, None], [9, 10, 11, 12]]
df2 = pd.DataFrame(l1, columns = ["A", "B", "C", "D"], index = ["AA", "BB", "CC"])

In [68]:
df2

    A   B   C     D
AA  1   2   3   4.0
BB  5   6   7   NaN
CC  9  10  11  12.0

- Create a Dataframe from a Dictionary

In [25]:
d1 = {"A": [1, 2, 3],
      "B": [4, None, 6],
      "C": [4, 6, 8]}

In [26]:
df3 = pd.DataFrame(d1)
df3

   A    B  C
0  1  4.0  4
1  2  NaN  6
2  3  6.0  8

In [27]:
df3a = pd.DataFrame(d1, columns = ["B", "A", "C"])
df3a

     B  A  C
0  4.0  1  4
1  NaN  2  6
2  6.0  3  8

In [28]:
df3b = pd.DataFrame(d1, columns = ["B", "A", "C", "D"])
df3b

     B  A  C    D
0  4.0  1  4  NaN
1  NaN  2  6  NaN
2  6.0  3  8  NaN

In [29]:
pd.__version__

'1.2.4'

- Create a Dataframe from a List of Dictionaries

In [30]:
l3 = [
    {"a": 1, "b": 2, "d": [3, 4]},
    {"a": 5, "b": 6, "c": 6}
]
df5 = pd.DataFrame(l3)

In [31]:
df5

   a  b       d    c
0  1  2  [3, 4]  NaN
1  5  6     NaN  6.0

- Get the Column names of a DataFrame, change it

In [32]:
df5.columns = ["AA", "BB", "CC", "DD"]
df5

   AA  BB      CC   DD
0   1   2  [3, 4]  NaN
1   5   6     NaN  6.0

- Print the head and tail of a DataFrame

In [33]:
df5.index

RangeIndex(start=0, stop=2, step=1)

In [34]:
df5.index = ("a", "b")
df5

   AA  BB      CC   DD
a   1   2  [3, 4]  NaN
b   5   6     NaN  6.0

In [35]:
df5.head()

   AA  BB      CC   DD
a   1   2  [3, 4]  NaN
b   5   6     NaN  6.0

In [37]:
df5.tail()

   AA  BB      CC   DD
a   1   2  [3, 4]  NaN
b   5   6     NaN  6.0

- Select a Column in a DataFrame

In [38]:
df5["BB"]

a    2
b    6
Name: BB, dtype: int64

In [39]:
df5.CC = [2, 3]

In [40]:
df5.DD = 6

In [41]:
df5

   AA  BB  CC  DD
a   1   2   2   6
b   5   6   3   6

- Add a column to a Dataframe

In [43]:
df5["CC"]["b"] = 20
df5

   AA  BB  CC  DD
a   1   2   2   6
b   5   6  20   6

In [44]:
df5["BB"] = [10, 20]
df5

   AA  BB  CC  DD
a   1  10   2   6
b   5  20  20   6

- Select a Row in a DataFrame

In [45]:
df5.loc["a"]

AA     1
BB    10
CC     2
DD     6
Name: a, dtype: int64

In [46]:
df6 = df5.T
df6

     a   b
AA   1   5
BB  10  20
CC   2  20
DD   6   6

In [47]:
df6.loc[["AA", "CC"]]

    a   b
AA  1   5
CC  2  20

In [48]:
df6.loc["AA":"CC"]

     a   b
AA   1   5
BB  10  20
CC   2  20

In [49]:
df6.iloc[3]

a    6
b    6
Name: DD, dtype: int64